app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "description", "status", "created_at", "updated_at") VALUES ('uifkdx', 'ilgou', 'iluhgoi', '2025-05-22 11:13:32.307155', '2025-05-22 11:13:32.307155') RETURNING "id"

  def destroy
    @post.destroy!
---
DELETE FROM "posts" WHERE "posts"."id" = 1